["", "[UNK]", ":", ")", "(percentile", ";", ".0", "_f", "i", "the", "a", ".", "summary", "on", ",", "and", "team", "onice", "top", "player", "generate", "his", "position", "based", "statistics", "name", "information", "following", "concise", "0", "is", "to", "he", "99", "of", "93", "96", "92", "97", "in", "95", "_goals", "_flurryscorevenueadjustedxgoals", "98", "94", "office", "who", "91", "with", "d", "100", "_a", "c", "_corsipercentage", "_xgoalspercentage", "_fenwickpercentage", "90", "penalties", "high", "for", "plays", "play", "puck", "l", "ice", "an", "offensive", "him", "he\u2019s", "strong", "shots", "elite", "defensive", "timeonbench", "_mediumdangershots", "game", "_rebounds", "penaltiesdrawn", "shotsblockedbyplayer", "_takeaways", ".56", "from", "_shotsongoal", "_secondaryassists", "_hits", "_giveaways", "_blockedshotattempts", "defenseman", "at", "_points", "_highdangershots", "_shotattempts", "r", "_primaryassists", "_lowdangershots", "physical", "_missedshots", "scoring", ".55", "brings", "'s", "when", ".57", "depth", "one", "offense", "net", "possession", "has", "goals", "forward", "chances", "ability", "as", "_reboundgoals", ".6", "energy", "while", "shot", ".59", "most", "line", "continues", "two", "-way", "steady", "role", "league", "make", "26", "25", "provides", "presence", "off", "minutes", "29", "veteran", "up", "into", "hard", "young", "style", "reliable", "rate", "defense", ".58", "28", "effective", "control", "30", "numbers", "contributes", "consistently", "both", "27", "23", "-ice", "playmaker", "makes", "goal", "but", "remains", "opponents", "helps", "center", "around", "35", "rebounds", "lineup", "drives", "blue", "18", ".61", "that", "every", "edge", "17", "winger", "quality", "metrics", "79", "16", "end", "speed", "ryan", "hits", "fla", "edm", "all", "31", ".63", "willingness", "smart", "number", "generating", "expected", "drive", "car", "blocks", "back", "among", "also", "80", "34", "power", "limited", "heavy", "forwards", "dependable", "defensively", "col", "can", "areas", "107", ".64", "wsh", "time", "though", "physicality", "key", "excels", "effort", "36", "well", "uta", "toughness", "tough", "through", "size", "shows", "out", "offensively", "jake", "fourth", "creating", "creates", "best", "are", "aggressive", "24", "22", ".54", "-volume", "vgk", "valuable", "skilled", "relentless", "pressure", "njd", "dal", "be", "against", "32", "104", "wpg", "volume", "totals", "thrives", "playmaking", "min", "middle", "lak", "instincts", "down", "dangerous", "creativity", "consistent", "by", "battles", "5", "105", ".62", "-line", "-danger", "zone", "vision", "van", "value", "team\u2019s", "still", "skating", "show", "ranking", "quick", "ott", "opportunities", "mtl", "league\u2019s", "keeps", "isn\u2019t", "generates", "excellent", "controls", "connor", "bench", "83", "81", "6", "33", "15", "101", "work", "turnovers", "transition", "tor", "tbl", "takeaways", "shift", "own", "nyr", "nyi", "impact", "grit", "get", "front", "drawing", "create", "cgy", "attempts", "alex", "afraid", "adds", "8", "7", "109", "106", "10", "threat", "teammates", "taking", "skill", "shooting", "responsible", "positioning", "point", "players", "penalty", "over", "often", "nsh", "new", "more", "leading", "force", "dynamic", "cbj", "buf", "blocked", "awareness", "adam", "78", "76", "zach", "very", "suggest", "strength", "stl", "solid", "showing", "quietly", "positive", "nick", "nhl", "movement", "lines", "level", "leadership", "joel", "hockey", "getting", "erik", "effectively", "edmonton", "dylan", "driving", "dominant", "defensemen", "bos", "blocking", "block", "ana", "40", "20", "125", "113", "108", "-six", "whose", "tyler", "talent", "supports", "stay", "shooter", "second", "sea", "scorer", "reflects", "prolific", "premier", "pit", "phi", "jack", "it", "highly", "favor", "draws", "contributing", "commitment", "body", "big", "attack", "assist", "82", "38", "37", "19", "11", "103", "-front", "-chance", "using", "touch", "system", "slot", "sean", "sam", "right", "results", "reads", "rasmus", "pucks", "near", "michael", "matt", "logs", "lead", "knack", "josh", "how", "gives", "experience", "even", "ends", "driver", "defenders", "deep", "consistency", "cole", "chi", "brandon", "assists", "9", "86", "84", "77", "47", "21", "114", "112", "102", ".66", "-moving", "-home", "-event", "-at", "uses", "tone", "tilt", "than", "structure", "stability", "smooth", "six", "reliability", "providing", "points", "performance", "or", "option", "night", "moves", "mix", "minnesota\u2019s", "massive", "making", "logan", "jordan", "hughes", "himself", "highlights", "good", "forechecking", "fits", "efficiently", "det", "defender", "creative", "converting", "complete", "complements", "colorado\u2019s", "bottom", "been", "become", "89", "87", "44", "41", "200", "118", "117", "116", ".65", ".21", "-first", "within", "wins", "william", "third", "sjs", "situations", "simple", "significant", "shutdown", "rugged", "resulting", "release", "rebound", "primary", "poise", "playing", "piece", "physically", "perfectly", "passing", "pace", "opposing", "occasionally", "o", "noah", "nearly", "morgan", "matchups", "luke", "looks", "leads", "kevin", "john", "hitter", "help", "group", "giving", "giveaway", "florida\u2019s", "finishing", "finding", "fenwick", "fearless", "engine", "efficient", "draw", "dominate", "difficult", "deployed", "crease", "contributor", "contribute", "constantly", "calm", "calgary\u2019s", "built", "buffalo\u2019s", "blend", "allow", "alexander", "agitating", "74", "70", "61", "43", "39", "237", "121", "115", "111", "110", ".02", "-nosed", "-end", "will", "whether", "whenever", "versatile", "vegas", "upon", "under", "thomas", "supporting", "spark", "space", "sometimes", "shown", "shoot", "shifts", "share", "setting", "set", "secondary", "scores", "scorers", "roster", "risk", "responsibility", "quantity", "pure", "production", "produces", "producer", "pavel", "part", "opposition", "not", "nhl\u2019s", "never", "needed", "mason", "kyle", "jonathan", "if", "identity", "hitting", "historic", "helping", "heavily", "hands", "grow", "flow", "fire", "dominates", "dominance", "developing", "corsi", "contribution", "confidence", "colton", "carolina", "career", "capable", "boston\u2019s", "blueliner", "blends", "anywhere", "active", "88", "85", "73", "53", "45", "42", "211", "130", "12", "119", ".82", ".45", "-minded", "-energy", "-blocking", "-around", "zachary", "york\u2019s", "where", "washington\u2019s", "washington", "vladislav", "usage", "trusted", "truly", "troy", "travis", "toward", "total", "tomas", "tkachuk", "timely", "tight", "things", "they", "tenacity", "taylor", "tasked", "tanner", "tanev", "tampa", "talented", "takeaway", "support", "structured", "strome", "stick", "steven", "stands", "standout", "st", "spots", "soft", "simon", "shine", "scoresheet", "score", "samuel", "rush", "reflection", "rebuilding", "reach", "rates", "rare", "ranks", "rangers\u2019", "raddysh", "punishing", "powerhouse", "plenty", "pettersson", "patrick", "pairing", "owen", "overall", "open", "north", "nikita", "miller", "mike", "mikael", "matthew", "martin", "marcus", "maintaining", "loves", "los", "linemates", "like", "kirill", "kind", "justin", "jump", "jesper", "jamie", "jackson", "j", "involved", "incredibly", "incredible", "highlight", "hardworking", "gustafsson", "gritty", "generational", "geekie", "forecheck", "foligno", "entire", "emil", "does", "dmitry", "discipline", "dirty", "direction", "derek", "david", "dallas", "conor", "comes", "combining", "combines", "combination", "colorado", "clear", "chris", "chips", "chaos", "centers", "casey", "carrier", "called", "brock", "bringing", "brett", "brayden", "brady", "blocker", "blake", "being", "balanced", "balance", "approach", "anthony", "andrei", "anchors", "anchor", "72", "62", "49", "212", "191", "168", "157", "146", "137", "132", "129", "124", "122", "120", ".t", ".95", ".85", ".76", ".3", ".23", ".22", "-south", "-skating", "-scoring", "-risk", "-quality", "-goals", "-driving", "'connor", "zones", "world", "workhorse", "winnipeg\u2019s", "winning", "which", "weapon", "ways", "vegas\u2019s", "used", "underline", "turnover", "traffic", "trademark", "toughest", "throws", "there", "their", "testament", "tenacious", "taken", "take", "stripping", "specialist", "sets", "season", "seamlessly", "san", "sacrifices", "rotation", "robert", "remain", "reflect", "rarely", "quickly", "punishes", "protect", "promise", "producing", "primarily", "powerful", "potential", "pittsburgh\u2019s", "philadelphia\u2019s", "performs", "output", "others", "opponent", "much", "moments", "modern", "mistakes", "mid", "mattias", "mark", "many", "maintains", "maintain", "low", "logging", "little", "leaders", "lanes", "killer", "jersey\u2019s", "jersey", "jacob", "its", "islanders\u2019", "islanders", "intensity", "important", "hurricanes", "honest", "higher", "heartbeat", "handles", "gustav", "giveaways", "give", "games", "frequently", "frame", "florida", "flair", "fit", "fires", "finishes", "finish", "finds", "find", "exceptionally", "exceptional", "excelling", "ethic", "enforcer", "emerged", "elias", "dominating", "doing", "developed", "despite", "defined", "creation", "corps", "core", "constant", "columbus\u2019s", "chipping", "chicago", "checks", "chance", "carolina\u2019s", "bruising", "boards", "better", "anaheim", "already", "along", "aggression", "adding", "71", "66", "65", "64", "57", "56", "48", "253", "239", "236", "234", "233", "228", "219", "210", "209", "202", "2", "195", "193", "189", "179", "161", "159", "156", "155", "154", "151", "148", "134", "131", "127", "126", ".84", ".8", ".75", ".73", ".72", ".71", ".7", ".69", ".68", ".67", ".53", ".16", ".15", ".1", "-taking", "-range", "-prone", "-making", "-hitting", "\u2014", "zuccarello", "zibanejad", "zetterlund", "zemgus", "zadorov", "zack", "zacha", "yet", "yakov", "wyatt", "working", "wood", "wings", "wingers", "wild", "why", "whitecloud", "werenski", "wennberg", "weegar", "wears", "warren", "walman", "voronkov", "vlasic", "vinnie", "vincent", "vince", "vilardi", "viktor", "victor", "versatility", "verhaeghe", "vasily", "vancouver\u2019s", "vancouver", "valeri", "uvis", "useful", "upside", "unstoppable", "unmatched", "uniquely", "unique", "underlying", "undeniable", "ultimate", "tye", "ty", "turning", "tuch", "trouba", "trocheck", "trevor", "trenin", "toropchenko", "toronto\u2019s", "toronto", "tony", "tommy", "tolvanen", "toffoli", "toews", "timo", "tim", "tilts", "throw", "thompson", "theodore", "thanks", "teuvo", "terry", "tends", "teddy", "tavares", "takes", "tage", "svechnikov", "suter", "sustain", "surprisingly", "superstar", "suggesting", "success", "struble", "stenlund", "stefan", "stecher", "staying", "stastney", "stars", "stamkos", "stable", "stabilize", "staal", "spurgeon", "spencer", "spence", "specialized", "special", "spaces", "sound", "some", "so", "slavin", "skjei", "skinner", "skin", "sissons", "signs", "siegenthaler", "sidney", "sides", "shy", "shutting", "sherwood", "shea", "shayne", "sharp", "shane", "severson", "seth", "serves", "serve", "sergachev", "sense", "seider", "seguin", "seeler", "sebastian", "seattle\u2019s", "seattle", "schwartz", "schneider", "schmidt", "schmaltz", "scheifele", "sanheim", "sandin", "sanderson", "samoskevich", "sacrificing", "rust", "rossi", "ross", "romanov", "roman", "roles", "rodrigues", "robertson", "ristolainen", "risky", "risks", "rink", "riemsdyk", "rielly", "ridly", "rickard", "resting", "remarkable", "reinhart", "reilly", "reflecting", "reckless", "rebuild", "real", "raymond", "rantanen", "rakell", "radko", "racking", "quinton", "quintessential", "quinn", "quiet", "puts", "pulock", "provorov", "provide", "prototypical", "protection", "protas", "prospect", "promising", "profile", "prime", "presences", "pontus", "poehling", "podkolzin", "playmakers", "place", "pionk", "pinto", "pierre", "philp", "phillip", "pezzetta", "peyton", "perry", "perfetti", "perfect", "percentages", "percentage", "perbix", "pelech", "pastrnak", "particularly", "parker", "parayko", "panarin", "palmieri", "pairings", "pachal", "outstanding", "ottawa\u2019s", "orlov", "olli", "olle", "olivier", "oliver", "oleksiak", "occasional", "nyquist", "nylander", "nurse", "nugent", "novak", "noticeable", "nosek", "nose", "noesen", "noel", "nino", "niko", "niederreiter", "nicolas", "nico", "nichushkin", "nic", "nelson", "neighbours", "neal", "nazem", "nathan", "nate", "nashville\u2019s", "nashville", "namestnikov", "myers", "murphy", "multiple", "moverare", "move", "morrissey", "montour", "monahan", "mobile", "mittelstadt", "mitch", "mistake", "misses", "miro", "miles", "mikkola", "mikko", "mikhail", "mika", "middleton", "mercer", "mentality", "meier", "mctavish", "mcnabb", "mcmichael", "mcleod", "mcilrath", "mcdonagh", "mcdavid", "mccabe", "mcbain", "max", "matty", "mats", "mathieu", "mathew", "matheson", "masterful", "master", "maroon", "marner", "mario", "marco", "marchment", "marchessault", "marchenko", "marchand", "manson", "mangiapane", "man", "malkin", "malinski", "malenstyn", "makar", "major", "made", "maclean", "macklin", "mackinnon", "mackie", "mackenzie", "machine", "macdermid", "lyubushkin", "lycksell", "luostarinen", "lundell", "lucas", "lowry", "louis\u2019s", "lorentz", "loose", "lomberg", "lohrei", "liner", "lindell", "life", "lian", "letang", "leon", "lehkonen", "lee", "leader", "lazar", "lawson", "lauzon", "later", "lars", "lapierre", "lane", "laferriere", "kyrou", "kuzmenko", "kurtis", "kuraly", "kunin", "kulikov", "kulak", "kucherov", "kris", "kreider", "krebs", "kovacevic", "kotkaniemi", "konecny", "kolesar", "koepke", "knies", "kleven", "kiviranta", "kings", "kesselring", "kerfoot", "kempe", "kelly", "keller", "keep", "keegan", "kastelic", "kasperi", "kartye", "karlsson", "kaprizov", "kane", "kaedan", "kadri", "just", "juraj", "juha", "josi", "joshua", "jose\u2019s", "jonas", "jonah", "johnston", "johnathan", "jj", "jets", "jesperi", "jeremy", "jeff", "jeannot", "jayden", "jason", "jarvis", "janmark", "jalen", "jakob", "jaden", "jaccob", "jaaska", "ivan", "isac", "involvement", "influence", "indicating", "imposing", "ilya", "ian", "iafallo", "hyman", "hutson", "hustle", "hundred", "huge", "horvat", "holtz", "holmberg", "holloway", "hischier", "hinostroza", "hertl", "henrique", "hendrix", "helenius", "heiskanen", "heineman", "heart", "hayton", "have", "haula", "hathaway", "hanifin", "handling", "hall", "hague", "hagel", "guessing", "guentzel", "gudas", "grzelcyk", "greig", "greer", "greatest", "great", "gostisbehere", "go", "glendening", "giroux", "girgensons", "gifted", "gets", "generation", "gavrikov", "gauthier", "gaudreau", "garnet", "garland", "gallagher", "gadjovich", "gabriel", "frost", "frequent", "frederick", "frank", "fox", "fowler", "four", "forsling", "forsberg", "forbort", "foegele", "flashy", "flashes", "finesse", "fills", "filip", "fiala", "ferraro", "felt", "faulk", "fast", "farabee", "fair", "facilitate", "fabian", "eyssimont", "explosive", "example", "evgenii", "evgeni", "everything", "evans", "evan", "essential", "esa", "eriksson", "eric", "engagement", "engage", "emotion", "embodies", "emberson", "eller", "ekman", "eklund", "ekblad", "ek", "eichel", "eetu", "eeli", "edvinsson", "edmundson", "earns", "early", "dvorak", "durzi", "during", "dunn", "duhaime", "duchene", "dubois", "drury", "drouin", "driven", "drew", "drawn", "drake", "draisaitl", "dowling", "dowd", "dorofeyev", "domi", "dobson", "doan", "dmitri", "disruptive", "disrupt", "dillon", "devon", "devils\u2019", "detroit\u2019s", "determination", "desimone", "demelo", "defines", "decision", "debrusk", "debrincat", "deangelo", "dawson", "darren", "darnell", "danault", "damon", "dakota", "dahlin", "dadonov", "cuylle", "cutter", "curtis", "crouse", "crosby", "crisp", "cozens", "coyle", "coverage", "counts", "coronato", "cornerstone", "corey", "cooley", "contact", "confident", "complementary", "compher", "competitiveness", "competition", "coleman", "cody", "clifton", "cleaning", "clayton", "claude", "classic", "clarke", "cizikas", "chychrun", "christian", "chatfield", "charlie", "chabot", "cernak", "celebrini", "ceci", "caufield", "carving", "carter", "carrick", "carlson", "carl", "cam", "calls", "cale", "byram", "byfield", "burns", "bunting", "bunches", "buchnevich", "bryan", "bruins", "brent", "brenden", "brendan", "brandt", "brand", "braden", "brad", "box", "bowen", "boston", "bortuzzo", "borgen", "boqvist", "boldy", "bogosian", "bo", "blueger", "blockers", "blending", "bichsel", "beyond", "bertuzzi", "benson", "benoit", "bennett", "benn", "beniers", "beecher", "bedard", "beauvillier", "bay\u2019s", "bay", "batherson", "barzal", "barrett", "barkov", "balinskis", "balances", "bahl", "backlund", "away", "aston", "asset", "arvidsson", "artturi", "artemi", "armia", "area", "anton", "angeles\u2019s", "angeles", "andrew", "andersson", "anderson", "anders", "anaheim\u2019s", "always", "allows", "aliaksei", "alexis", "alexey", "alexandre", "aleksander", "aho", "agitator", "agitation", "advantage", "adrian", "adept", "activate", "acciari", "absolute", "about", "aaron", "75", "69", "68", "67", "550", "52", "51", "506", "50", "465", "447", "444", "433", "424", "421", "410", "4", "393", "320", "296", "279", "270", "267", "265", "256", "255", "246", "245", "244", "243", "242", "241", "240", "235", "231", "223", "222", "218", "214", "213", "208", "207", "205", "204", "196", "188", "184", "180", "176", "174", "173", "172", "171", "170", "167", "165", "164", "163", "153", "150", "149", "147", "143", "142", "14", "136", "135", ".j", ".97", ".96", ".91", ".88", ".79", ".77", ".74", ".52", ".5", ".48", ".47", ".46", ".41", ".37", ".36", ".33", ".31", ".29", ".28", ".19", ".17", ".11", ".09", ".08", ".07", "-working", "-tier", "-reese", "-paced", "-luc", "-larsson", "-hopkins", "-high", "-heavy", "-free", "'reilly", "'", "york", "worker", "without", "willing", "whistles", "weight", "wear", "way", "warrior", "walks", "walker\u2019s", "walker", "virtually", "vatrano\u2019s", "vatrano", "variety", "utah\u2019s", "utah", "usual", "unleashes", "undisputed", "undisciplined", "underrated", "uncomfortable", "unblocked", "unafraid", "turns", "trust", "tries", "translated", "transforms", "trait", "towering", "touches", "topping", "too", "toes", "tippett\u2019s", "tippett", "times", "throwing", "throwback", "throughout", "thriving", "thrive", "thrilling", "three", "threats", "thief", "them", "thankless", "ter\u00e4v\u00e4inen", "teravainen", "teams", "talents", "systems", "sword", "sustained", "surprising", "supremely", "suppressing", "st\u00fctzle\u2019s", "sttzle", "struggling", "strip", "streak", "storied", "stops", "stir", "steadying", "steadiness", "stays", "stats", "statistically", "starts", "stars\u2019", "stanley\u2019s", "stanley", "stankoven\u2019s", "stankoven", "stalwart", "stages", "stabilizing", "spot", "spent", "spending", "speedy", "specific", "specializes", "sparks", "sparking", "soul", "solidify", "sniper", "sneaky", "smoothly", "slowed", "slafkovsk\u00fd", "slafkovsk", "skillset", "skills", "skaters", "situational", "situation", "sitting", "singular", "single", "simply", "sign", "sight", "shying", "showcasing", "short", "shies", "sheltered", "sheer", "seventh", "setup", "settled", "served", "sees", "seen", "scratch", "savvy", "sandpaper", "rotated", "roslovic\u2019s", "roslovic", "robinson\u2019s", "robinson", "rising", "result", "rests", "rest", "responsibly", "relied", "regularly", "regular", "registering", "regardless", "reflected", "refining", "reduced", "rediscovered", "recovery", "recording", "recorded", "reason", "read", "rank", "rangers", "range", "putting", "pushing", "pushes", "push", "purest", "proves", "proved", "prove", "protecting", "profound", "productive", "product", "produce", "problem", "predators", "precision", "potent", "posting", "possessions", "possessing", "possesses", "positionally", "positional", "polished", "poised", "pointing", "playoffs", "played", "places", "pittsburgh", "pinches", "piling", "pietrangelo\u2019s", "pietrangelo", "philadelphia", "peterka\u2019s", "peterka", "pests", "penguins\u2019", "penguins", "penalized", "pearson\u2019s", "pearson", "peak", "pay", "patient", "patience", "passes", "parts", "panthers\u2019", "pairs", "paired", "pair", "page", "overwhelming", "outplaying", "outlet", "other", "organizational", "organization", "once", "olofsson\u2019s", "olofsson", "old", "now", "nothing", "nonstop", "no", "nightmare", "niche", "ne\u010das", "needs", "necas", "m\u00e4\u00e4tt\u00e4", "mtt", "moving", "moritz", "montreal\u2019s", "montreal", "monster", "momentum", "modest", "moderate", "mobility", "mixes", "mixed", "missed", "miss", "mischief", "minute", "michkov\u2019s", "michkov", "mean", "may", "matvei", "mature", "matchup", "mastered", "martinook\u2019s", "martinook", "managing", "majority", "main", "magician", "macewen\u2019s", "macewen", "l\u2019heureux", "lundestr\u00f6m", "lundestrom", "lower", "louis\u2019", "louis", "lot", "looking", "longer", "long", "logged", "living", "lindholm\u2019s", "lindholm", "limits", "limit", "lilleberg\u2019s", "lilleberg", "lightning\u2019s", "lightning", "light", "levels", "lethal", "learning", "learn", "leans", "late", "last", "larsson\u2019s", "larsson", "large", "lands", "lafreni\u00e8re\u2019s", "lafrenire", "lacombe\u2019s", "lacombe", "k\u2019andre", "kraken", "korczak\u2019s", "korczak", "knows", "known", "knights\u2019", "kings\u2019", "kills", "killorn\u2019s", "killorn", "killing", "kill", "kiefer", "kapanen\u2019s", "kapanen", "k", "jumps", "jumping", "juggernaut", "jose", "join", "job", "jared", "it\u2019s", "irritating", "iq", "invaluable", "intimidating", "intense", "intelligent", "insurance", "inside", "innate", "injury", "injuries", "individually", "indicator", "indicates", "indicate", "impressive", "impressed", "impress", "impossible", "impacts", "impactful", "immense", "imaginable", "huberdeau\u2019s", "huberdeau", "howden\u2019s", "howden", "holding", "hockey\u2019s", "hitters", "hit", "highlighting", "hesitates", "healthy", "hasn\u2019t", "harley\u2019s", "harley", "handle", "hamilton", "had", "gudbranson\u2019s", "gudbranson", "grundstr\u00f6m", "grundstrom", "growth", "grows", "grinding", "grinder", "grind", "granlund\u2019s", "granlund", "golden", "goaltender", "goalies", "goading", "given", "girard\u2019s", "girard", "generated", "generally", "gaudette\u2019s", "gaudette", "gaps", "future", "fuels", "frustrating", "found", "forechecks", "forcing", "focused", "flyers", "fluctuates", "flowing", "flexible", "flexibility", "flames", "five", "finishers", "finisher", "filling", "fill", "figure", "fight", "fiery", "few", "feisty", "feistiness", "feh\u00e9rv\u00e1ry\u2019s", "fehrvry", "feel", "favorite", "favorable", "far", "fan", "facet", "faceoffs", "face", "faber\u2019s", "faber", "extra", "extends", "experienced", "exciting", "evident", "everywhere", "established", "equally", "environment", "ensures", "energizes", "energetic", "endurance", "encouraging", "emotional", "emerging", "embraces", "embodying", "embodiment", "elevates", "ekholm\u2019s", "ekholm", "efforts", "efficiency", "effect", "edmonton\u2019s", "earned", "earn", "durable", "ducks\u2019", "drop", "drag", "dougie", "double", "donato\u2019s", "donato", "doesn\u2019t", "distraction", "disrupting", "displays", "display", "disciplined", "directions", "dips", "dimension", "diligent", "differential", "difference", "development", "develop", "detail", "deployment", "demonstrates", "delivers", "delivering", "defy", "defenses", "defend", "dazzle", "dallas\u2019s", "dallas\u2019", "cross", "creator", "crashes", "crafty", "courage", "could", "costs", "correlates", "cornerstones", "corners", "convert", "conversion", "controlling", "controlled", "continuing", "continued", "contending", "conservative", "composed", "component", "competitor", "compete", "come", "cog", "coaches", "clearly", "clearing", "clean", "cirelli\u2019s", "cirelli", "chemistry", "checking", "charts", "chart", "chaotic", "changing", "championship", "cerebral", "centerpiece", "ceiling", "catalyst", "carved", "carve", "carrying", "care", "capacity", "calming", "calgary", "byproduct", "bury", "bursts", "burden", "bruins\u2019", "brown\u2019s", "brown", "broken", "bring", "brightest", "breed", "breakout", "breaking", "bratt\u2019s", "bratt", "boost", "boasting", "board", "blueliners", "blossomed", "blazing", "blackhawks", "bite", "between", "benefits", "behind", "beginning", "becoming", "beck", "beat", "battling", "battle", "balancing", "backfires", "backed", "backbone", "aware", "avoid", "authority", "attention", "attacking", "assignments", "assertive", "aspects", "ask", "artist", "art", "arguably", "anyone", "another", "angles", "alongside", "almost", "agitate", "aggressiveness", "aggressively", "age", "again", "after", "added", "add", "adapted", "acumen", "actual", "activity", "action", "accountability", "absence", "above", "638", "63", "624", "623", "602", "60", "590", "586", "58", "551", "547", "531", "525", "517", "507", "496", "493", "484", "481", "474", "466", "462", "461", "46", "458", "457", "456", "449", "445", "437", "436", "434", "432", "422", "415", "409", "407", "404", "403", "402", "400", "396", "394", "383", "382", "378", "375", "368", "367", "343", "335", "333", "325", "319", "318", "309", "306", "301", "300", "298", "297", "291", "285", "282", "281", "278", "276", "275", "272", "271", "266", "262", "261", "257", "251375", "248177", "246665", "243082", "240936", "240565", "239421", "236695", "235910", "234634", "234522", "233152", "232883", "232874", "232514", "232503", "232316", "232242", "232002", "232", "231719", "231626", "230967", "230454", "230257", "229927", "229711", "229580", "229418", "229046", "229028", "229", "228505", "228406", "227895", "227676", "227634", "227018", "227", "226497", "226249", "225801", "225720", "225046", "225", "224523", "224330", "224221", "218614", "218162", "217622", "217", "216", "215", "214198", "213150", "212635", "211858", "211655", "208981", "207215", "207123", "206701", "206670", "206641", "206416", "206", "205435", "205146", "204115", "204026", "203737", "203717", "203084", "203", "201527", "199", "198", "194", "192", "187", "186", "183", "182", "181", "178", "177", "175", "169", "162", "160", "152", "144", "140", "138", "123", ".99", ".94", ".93", ".92", ".9", ".89", ".83", ".81", ".78", ".51", ".49", ".44", ".42", ".4", ".39", ".35", ".32", ".26", ".25", ".18", ".06", ".04", ".03", ".01", "-zone", "-trades", "-to", "-term", "-tempo", "-style", "-sound", "-shooting", "-setter", "-scorer", "-school", "-rounded", "-quick", "-questions", "-possession", "-playing", "-play", "-pairing", "-out", "-oriented", "-on", "-of", "-munching", "-mover", "-maker", "-liner", "-led", "-later", "-it", "-intensity", "-handedly", "-from", "-four", "-fought", "-forward", "-focused", "-five", "-effort", "-edged", "-driven", "-drawing", "-dominant", "-collar", "-charging", "-changing", "-best", "-average", "-anywhere", "-all", "-activity", "'heureux", "'garbage", "'andre"]